package com.github.hukojiayc.sme.graph.dto;

import com.github.hukojiayc.sme.graph.dto.Components.CreateType;
import java.util.ArrayList;
import java.util.List;

public enum OsbType {
  osb038_1(TbType.tb038, "Восточное головное отделение","Балашиха"),
  osb038_2(TbType.tb038, "Западное головное отделение","Одинцово"),
  osb038_3(TbType.tb038, "Северное головное отделение", "Мытищи"),
  osb038_4(TbType.tb038, "Южное головное отделение", "Подольск"),

  osb0139013(TbType.tb013, "Головное отделение по Воронежской области", "Воронеж"),
  osb0138592(TbType.tb013, "Белгородское отделение №8592", "Белгород"),
  osb0138593(TbType.tb013, "Липецкое отделение №8593","Липецк"),
  osb0138594(TbType.tb013, "Тамбовское отделение №8594","Тамбов"),
  osb0138595(TbType.tb013, "Орловское отделение №8595","Орел"),
  osb0138596(TbType.tb013, "Курское отделение №8596","Курск"),

//  osb0169016(TbType.tb013, "Головное отделение №9016"),
  osb0165940(TbType.tb016, "Югорское отделение №5940","Сургут"),
  osb0167003(TbType.tb016, "Свердловское отделение №7003","Екатеринбург"),
  osb0168369(TbType.tb016, "Ямало-Ненецкое отделение №8369","Новый Уренгой"),
  osb0168597(TbType.tb016, "Челябинское отделение №8597","Челябинск"),
  osb0168598(TbType.tb016, "Башкирское отделение №8598","Уфа"),
  osb0168599(TbType.tb016, "Курганское отделение №8599","Курган"),
  osb0168647(TbType.tb016, "Западно-Сибирское отделение №8647","Тюмень"),

//  osb0189018(TbType.tb018, "Головное отделение №9018"),
  osb0188586(TbType.tb018, "Иркутское отделение №8586", "Иркутск"),
  osb0188600(TbType.tb018, "Читинское отделение №8600", "Чита"),
  osb0188601(TbType.tb018, "Бурятское отделение №8601", "Улан-Удэ"),
  osb0188603(TbType.tb018, "Якутское отделение №8603", "Якутск"),

  osb04017(TbType.tb040, "Ярославское отделение №17","Ярославль"),
  osb0408604(TbType.tb040, "Тульское отделение №8604", "Тула"),
  osb0408605(TbType.tb040, "Брянское отделение №8605","Брянск"),
  osb0408606(TbType.tb040, "Рязанское отделение №8606","Рязань"),
  osb0408607(TbType.tb040, "Тверское отделение №8607","Тверь"),
  osb0408608(TbType.tb040, "Калужское отделение №8608","Калуга"),
  osb0408609(TbType.tb040, "Смоленское отделение №8609","Смоленск"),
  osb0408639(TbType.tb040, "Ивановское отделение №8639","Иваново"),
  osb0408640(TbType.tb040, "Костромское отделение №8640","Кострома"),

  osb0429042(TbType.tb042, "Головное отделение №9042", "Нижний Новгород"),
  osb0426984(TbType.tb042, "Пермское отделение №6984", "Пермь"),
  osb0428589(TbType.tb042, "Мордовское отделение №8589", "Саранск"),
  osb0428610(TbType.tb042, "Банк Татарстан отделение №8610", "Казань"),
  osb0428611(TbType.tb042, "Владимирское отделение №8611", "Владимир"),
  osb0428612(TbType.tb042, "Кировское отделение №8612", "Киров"),
  osb0428613(TbType.tb042, "Чувашское отделение №8613", "Чебоксары"),
  osb0428614(TbType.tb042, "Марий Эл отделение №8614", "Йошкар-Ола"),
  osb0428618(TbType.tb042, "Удмуртское отделение №8618", "Ижевск"),

//  osb0449044(TbType.tb044, "Головное отделение №9044"),
//  osb0448558(TbType.tb044, "Горно-Алтайское отделение №8558"),
//  osb0448591(TbType.tb044, "Кызылское отделение №8591"),
//  osb0448602(TbType.tb044, "Абаканское отделение №8602"),
  osb0448047(TbType.tb044, "Новосибирское отделение №8047","Новосибирск"),
  osb0448615(TbType.tb044, "Кемеровское отделение №8615","Кемерово"),
  osb0448616(TbType.tb044, "Томское отделение №8616","Томск"),
  osb0448634(TbType.tb044, "Омское отделение №8634","Омск"),
  osb0448644(TbType.tb044, "Алтайское отделение №8644","Барнаул"),
  osb0448646(TbType.tb044, "Красноярское отделение №8646","Красноярск"),

//  osb0529052(TbType.tb052, "Головное отделение №9052"),
//  osb0521806(TbType.tb052, "Центральное отделение №1806"),
  osb0525221(TbType.tb052, "Ростовское отделение №5221","Ростов-на-Дону"),
  osb0525230(TbType.tb052, "Ставропольское отделение №5230","Ставрополь"),
  osb0528579(TbType.tb052, "Калмыцкое отделение №8579","Элиста"),
  osb0528585(TbType.tb052, "Карачаево-Черкесское отделение №8585","Черкесск"),
  osb0528590(TbType.tb052, "Дагестанское отделение №8590","Махачкала"),
  osb0528619(TbType.tb052, "Краснодарское отделение №8619","Краснодар"),
//  osb0528620(TbType.tb052, "Адыгейское отделение №8620"),
  osb0528631(TbType.tb052, "Кабардино-Балкарское отделение №8631","Нальчик"),
  osb0528632(TbType.tb052, "Северо-Осетинское отделение №8632","Владикавказ"),
  osb0528633(TbType.tb052, "Ингушское отделение №8633","Назрань"),
  osb0528643(TbType.tb052, "Чеченское отделение №8643","Грозный"),

//  osb0549054(TbType.tb054, "Головное отделение №9054"),
  osb0546991(TbType.tb054, "Самарское отделение №6991", "Самара"),
  osb0548588(TbType.tb054, "Ульяновское отделение №8588", "Ульяновск"),
  osb0548621(TbType.tb054, "Волгоградское отделение №8621", "Волгоград"),
  osb0548622(TbType.tb054, "Саратовское отделение №8622", "Саратов"),
  osb0548623(TbType.tb054, "Оренбургское отделение №8623", "Оренбург"),
  osb0548624(TbType.tb054, "Пензенское отделение №8624", "Пенза"),
  osb0548625(TbType.tb054, "Астраханское отделение №8625", "Астрахань"),

  osb0559055(TbType.tb055, "Головное отделение №9055", "Санкт-Петербург"),
  osb0558617(TbType.tb055, "Коми отделение №8617","Сыктывкар"),
  osb0558626(TbType.tb055, "Калининградское отделение №8626","Калининград"),
  osb0558627(TbType.tb055, "Мурманское отделение №8627", "Мурманск"),
  osb0558628(TbType.tb055, "Карельское отделение №8628","Петрозаводск"),
  osb0558629(TbType.tb055, "Новгородское отделение №8629","Великий Новгород"),
  osb0558630(TbType.tb055, "Псковское отделение №8630","Псков"),
  osb0558637(TbType.tb055, "Архангельское отделение №8637", "Архангельск"),
  osb0558638(TbType.tb055, "Вологодское отделение №8638","Вологда"),

  osb0709070(TbType.tb070, "Головное отделение по Хабаровскому краю", "Хабаровск"),
  osb0704157(TbType.tb070, "Биробиджанское отделение №4157", "Биробиджан"),
  osb0708556(TbType.tb070, "Камчатское отделение №8556", "Петропавловск-Камчатский"),
  osb0708567(TbType.tb070, "Южно-Сахалинское отделение №8567", "Южно-Сахалинск"),
  osb0708635(TbType.tb070, "Приморское отделение №8635", "Владивосток"),
  osb0708636(TbType.tb070, "Благовещенское отделение №8636", "Благовещенск"),
  osb0708557(TbType.tb070, "Чукотское головное отделение", "Благовещенск"),
  osb0708645(TbType.tb070, "Северо-Восточное отделение №8645", "Анадырь");

  private final TbType tb;
  private final String value;
  private final String city;

  OsbType(TbType tb, String value, String city) {
    this.tb = tb;
    this.value = value;
    this.city = city;
  }

  public TbType getTb() {
    return tb;
  }

  public String getValue() {
    return value;
  }

  public String getCity() {
    return city;
  }

  public static List<OsbType> getOsbListByTb(TbType tb) {
    List<OsbType> osbTypeList = new ArrayList<>();
    for (OsbType osbType : OsbType.values()) {
      if (osbType.tb == tb) {
        osbTypeList.add(osbType);
      }
    }
    return osbTypeList;
  }

  public static String getOptions() {
    StringBuilder stringBuilder = new StringBuilder();
    for (OsbType osbType : OsbType.values()) {
      stringBuilder.append(
              CreateType.option.getValue(osbType.name(), osbType.getCity())
          )
          .append("\n");
    }
    return stringBuilder.toString();
  }
}
